import React from "react";
import Link from "next/link";
import styles from "./PrivacyPolicy.module.scss";
import { Container } from "../../../components";

export default function PrivacyPolicyPage() {
	return (
		<Container className={styles.container}>
			<div className={styles.breadcrumbs}>
				<Link href='/'>Главная</Link> / <span>Политика конфиденциальности</span>
			</div>
			<h1 className={styles.title}>Политика конфиденциальности</h1>
			<div className={styles.content}>
				<p>
					ИП Рахимов Руслан Ренатович. ИНН: 631820275200, ОГРНИП: 325632700128721.
					Адрес: Самарская область, г. Самара, ул. Авроры, д. 201. Адрес электронной
					почты: <a href='mailto:hello@emessage.su'>hello@emessage.su</a>.
				</p>
				<p>Дата вступления в силу: «23» октября 2025 г.</p>
				<p>
					Настоящая Политика конфиденциальности персональных данных (далее -
					Политика конфиденциальности, Политика) является неотъемлемой частью
					Оферты, размещенной на сайте в сети Интернет по адресу{" "}
					<a href='https://emessage.su/'>https://emessage.su/</a>, далее – Сайт,
					принадлежащий ИП Рахимов Руслан Ренатович, оказывающий услуги по
					продвижению в социальных сетях, деятельности маркетингового агентства,
					представленные на Интернет-сайте{" "}
					<a href='https://emessage.su/'>https://emessage.su/</a>.
				</p>
				<p>
					Сервисы Сайта – интерактивные (диалоговые) программные компоненты на
					страницах Сайта, используемые для интеграции с информационными системами и
					предоставляющие пользователям Сайта определенные возможности по доступу к
					информации на Сайт, а именно сервисы управления интернет услугами, приема
					платежей и аналитики, CRM-системы (далее - Сервисы, Сервисы Сайта).
				</p>
				<p>
					Использование сервисов Сайта означает безоговорочное согласие
					Пользователя с настоящей Политикой и указанными в ней условиями обработки
					его персональной информации; в случае несогласия с этими условиями
					Пользователь должен воздержаться от использования сервисов.
				</p>

				<h2>1. Общие положения</h2>
				<p>
					1.1. В рамках настоящей Политики под персональной информацией
					Пользователя понимаются:
				</p>
				<ul>
					<li>
						1.1.1. Персональная информация, которую Пользователь предоставляет о себе
						самостоятельно при регистрации (создании учетной записи) или в процессе
						использования Сервисов, включая персональные данные Пользователя.
						Обязательная для предоставления Сервисов информация помечена специальным
						образом.
					</li>
					<li>
						1.1.2. Данные, которые автоматически передаются сервисам Сайта в процессе
						их использования с помощью установленного на устройстве Пользователя
						программного обеспечения, в том числе IP-адрес, данные файлов cookie,
						информация о браузере Пользователя (или иной программе, с помощью
						которой осуществляется доступ к сервисам), технические характеристики
						оборудования и программного обеспечения, используемых Пользователем, дата
						и время доступа к сервисам, адреса запрашиваемых страниц и иная подобная
						информация.
					</li>
					<li>
						1.1.3. Настоящая Политика конфиденциальности применяется только к Сайту{" "}
						<a href='https://emessage.su/'>https://emessage.su/</a>. Сайт{" "}
						<a href='https://emessage.su/'>https://emessage.su/</a> не контролирует и
						не несет ответственности за сайты третьих лиц, на которые Пользователь
						может перейти по ссылкам, доступным на Сайте{" "}
						<a href='https://emessage.su/'>https://emessage.su/</a>.
					</li>
				</ul>

				<h2>2. Цели обработки персональной информации пользователей</h2>
				<p>
					2.1. Сайт собирает и хранит только ту персональную информацию, которая
					необходима для предоставления сервисов или исполнения соглашений и
					договоров с Пользователем, за исключением случаев, когда
					законодательством предусмотрено обязательное хранение персональной
					информации в течение определенного законом срока.
				</p>
				<ul>
					<li>
						2.1.1. В случае получения уведомления от Пользователя об отзыве согласия
						на обработку персональных данных Сайт прекращает обработку персональных
						данных Пользователя в срок, не превышающий 10 рабочих дней с момента
						получения.
					</li>
					<li>
						2.1.2. Уведомление об отзыве согласия на обработку персональных данных
						направляется на адрес электронной почты{" "}
						<a href='mailto:hello@emessage.su'>hello@emessage.su</a>, а также путем
						письменного обращения по адресу: 443045, Самарская область, г. Самара,
						ул. Авроры, д. 201 кв. 108.
					</li>
				</ul>
				<p>2.2. Персональную информацию Пользователя Сайт обрабатывает в следующих целях:</p>
				<ul>
					<li>
						2.2.1. Идентификации Пользователя, зарегистрированного на Сайте, для
						оформления интернет заказа на оказания услуг по продвижению в социальных
						сетях, деятельности маркетингового агентства.
					</li>
					<li>2.2.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта.</li>
					<li>
						2.2.3. Установления с Пользователем обратной связи, включая направление
						уведомлений, запросов, касающихся использования Сайта, оказания услуг,
						обработку запросов и заявок от Пользователя.
					</li>
					<li>
						2.2.4. Определения места нахождения Пользователя для обеспечения
						безопасности, предотвращения мошенничества.
					</li>
					<li>
						2.2.5. Подтверждения достоверности и полноты персональных данных,
						предоставленных Пользователем.
					</li>
					<li>2.2.6. Создания учетной записи, если Пользователь дал согласие на ее создание.</li>
					<li>2.2.7. Уведомления Пользователя Сайта о внесении изменений, если таковое предусмотрено.</li>
					<li>
						2.2.8. Предоставления Пользователю эффективной клиентской и технической
						поддержки при возникновении проблем, связанных с использованием Сайта.
					</li>
					<li>
						2.2.9. Осуществления рекламной деятельности в рамках Федерального закона
						«О рекламе» от 13.03.2006 No 38-ФЗ (последняя редакция), с согласия
						Пользователя.
					</li>
				</ul>

				<h2>3. Условия обработки персональной информации пользователей и ее передачи третьим лицам</h2>
				<p>
					3.1. Сайт хранит персональную информацию Пользователей в соответствии с
					внутренними регламентами конкретных сервисов.
				</p>
				<p>
					3.2. В отношении персональной информации Пользователя сохраняется ее
					конфиденциальность, кроме случаев добровольного предоставления
					Пользователем информации о себе для общего доступа неограниченному кругу
					лиц. При использовании отдельных сервисов Пользователь соглашается с тем,
					что определенная часть его персональной информации становится
					общедоступной.
				</p>
				<p>3.3. Сайт вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:</p>
				<ul>
					<li>3.3.1. Пользователь выразил согласие на такие действия.</li>
					<li>
						3.3.2. Передача необходима для использования Пользователем определенного
						сервиса либо для исполнения определенного соглашения или договора с
						Пользователем.
					</li>
					<li>
						3.3.3. Передача предусмотрена российским или иным применимым
						законодательством в рамках установленной законодательством процедуры.
					</li>
					<li>
						3.3.4. В случае продажи Сайта к приобретателю переходят все обязательства
						по соблюдению условий настоящей Политики применительно к полученной им
						персональной информации.
					</li>
				</ul>
				<p>
					3.4. Обработка персональных данных Пользователя осуществляется без
					ограничения срока следующими способами: сбор, запись, систематизация,
					накопление, хранение, уточнение (обновление, изменение), извлечение,
					использование, передача (распространение, предоставление, доступ),
					обезличивание, блокирование, удаление, уничтожение персональных данных, в
					том числе в информационных системах персональных данных с использованием
					средств автоматизации или без использования таких средств. Обработка
					персональных данных Пользователей осуществляется в соответствии с
					Федеральным законом от 27.07.2006 No 152-ФЗ «О персональных данных».
				</p>
				<p>
					3.5. При утрате или разглашении персональных данных Администрация Сайта
					информирует Пользователя об утрате или разглашении персональных данных.
				</p>
				<p>
					3.6. Администрация Сайта принимает необходимые организационные и
					технические меры для защиты персональной информации Пользователя от
					неправомерного или случайного доступа, уничтожения, изменения,
					блокирования, копирования, распространения, а также от иных неправомерных
					действий третьих лиц.
				</p>
				<p>
					3.7. Администрация Сайта совместно с Пользователем принимает все
					необходимые меры по предотвращению убытков или иных отрицательных
					последствий, вызванных утратой или разглашением персональных данных
					Пользователя.
				</p>

				<h2>4. Обязательства сторон</h2>
				<p>4.1. Пользователь обязан:</p>
				<ul>
					<li>4.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом.</li>
					<li>4.1.2. Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.</li>
					<li>4.1.3. Заполнить достоверную информацию и подписать согласие на обработку персональных данных пользователей сайта https://emessage.su/.</li>
				</ul>
				<p>4.2. Администрация Сайта обязана:</p>
				<ul>
					<li>
						4.2.1. Использовать полученную информацию исключительно для целей,
						указанных в настоящей Политике конфиденциальности и Положении о
						персональных данных.
					</li>
					<li>
						4.2.2. Обеспечить хранение конфиденциальной информации в тайне, не
						разглашать без предварительного письменного разрешения Пользователя, а
						также не осуществлять продажу, обмен, опубликование либо разглашение иными
						возможными способами переданных персональных данных Пользователя, за
						исключением предусмотренных настоящей Политикой конфиденциальности и
						Положением о персональных данных.
					</li>
					<li>
						4.2.3. Для обеспечения защиты персональных данных Пользователя при их
						обработке приняты правовые, организационные и технические меры от
						несанкционированного, неправомерного или случайного доступа к
						персональным данным, уничтожения, изменения, блокирования, копирования,
						предоставления, распространения персональных данных, а также от иных
						неправомерных действий в отношении персональных данных.
					</li>
					<li>
						4.2.4. Осуществить блокирование персональных данных, относящихся к
						соответствующему Пользователю, с момента обращения или запроса
						Пользователя или его законного представителя либо уполномоченного органа
						по защите прав субъектов персональных данных на период проверки в случае
						выявления недостоверных персональных данных или неправомерных действий.
					</li>
				</ul>

				<h2>5. Ответственность сторон</h2>
				<p>
					5.1. Администрация Сайта, не исполнившая свои обязательства, несет
					ответственность за убытки, понесенные Пользователем в связи с неправомерным
					использованием персональных данных, в соответствии с законодательством
					Российской Федерации.
				</p>
				<p>5.2. В случае утраты или разглашения конфиденциальной информации Администрация Сайта не несет ответственности, если данная конфиденциальная информация:</p>
				<ul>
					<li>5.2.1. Стала публичным достоянием до ее утраты или разглашения.</li>
					<li>5.2.2. Была получена от третьей стороны до момента ее получения Администрацией Сайта.</li>
					<li>5.2.3. Была разглашена с согласия Пользователя.</li>
				</ul>

				<h2>6. Разрешение споров</h2>
				<p>
					6.1. До обращения в суд с иском по спорам, возникающим из отношений между
					Пользователем Сайта и Администрацией Сайта, обязательным является
					предъявление претензии (письменного предложения о добровольном
					урегулировании спора).
				</p>
				<p>
					6.2. Получатель претензии в течение 30 (тридцати) календарных дней со дня
					получения претензии письменно уведомляет заявителя претензии о результатах
					рассмотрения претензии.
				</p>
				<p>
					6.3. При не достижении соглашения спор будет передан на рассмотрение в суд
					в соответствии с действующим законодательством Российской Федерации.
				</p>
				<p>
					6.4. К настоящей Политике конфиденциальности и отношениям между
					Пользователем и Администрацией Сайта применяется действующее
					законодательство Российской Федерации.
				</p>

				<h2>7. Дополнительные условия</h2>
				<p>
					7.1. Администрация Сайта вправе в любое время вносить изменения и/или
					дополнения в настоящую Политику конфиденциальности без согласия
					Пользователя. Рекомендуем Пользователям регулярно проверять эту страницу,
					чтобы быть в курсе любых изменений о том, как мы защищаем информацию о
					Пользователях, которую мы собираем.
				</p>
				<p>
					Используя наш Сайт, вы соглашаетесь с принятием на себя ответственности за
					периодическое ознакомление с Политикой конфиденциальности и изменениями в
					ней.
				</p>
				<p>
					7.2. Новая Политика конфиденциальности вступает в силу с момента ее
					размещения на Сайте, если иное не предусмотрено новой редакцией Политики
					конфиденциальности.
				</p>
				<p>
					7.3. Все предложения или вопросы по настоящей Политике конфиденциальности
					следует сообщать в раздел Техническая поддержка, расположенный в сети
					Интернет по адресу{" "}
					<a href='https://emessage.su/'>https://emessage.su/</a>.
				</p>
				<p>
					7.4. Действующая актуальная версия Политики конфиденциальности размещена на
					Сайте <a href='https://emessage.su/'>https://emessage.su/</a>.
				</p>
				<p>
					7.5. Настоящая Политика конфиденциальности является неотъемлемой частью
					Оферты и Соглашения об использовании материалов и сервисов Интернет-сайта
					(Пользовательское соглашение), размещенные на странице по адресу{" "}
					<a href='https://emessage.su/'>https://emessage.su/</a>.
				</p>
				<p>
					7.6. Используя наш Сайт, вы выражаете свое согласие с настоящей Политикой
					конфиденциальности. Если вы не согласны с этой Политикой, пожалуйста, не
					используйте наш Сайт. Ваше дальнейшее использование Сайта после внесения
					изменений в настоящую Политику будет рассматриваться как Ваше согласие с
					внесенными изменениями.
				</p>

				<h2>Контактная информация оператора персональных данных</h2>
				<p>
					Наименование: Индивидуальный предприниматель Рахимов Руслан Ренатович.
					Адрес: Самарская область, г. Самара, ул. Авроры, д. 201 кв. 108.
				</p>
				<p>
					ИНН: 631820275200, ОГРНИП: 325632700128721. Оператор внесен в реестр
					Роскомнадзора: регистрационный номер 63-25-059061, дата подачи 21.11.2025.
					Контактный телефон: <a href='tel:+79959338372'>+7 (995) 933-83-72</a>.
				</p>
				<p>
					Адрес электронной почты для обращений:{" "}
					<a href='mailto:hello@emessage.su'>hello@emessage.su</a>.
				</p>

				<h2>Приложения</h2>
				<ul>
					<li>Соглашение об использовании cookie-файлов.</li>
					<li>Форма Согласия на получение информации рекламного характера, в том числе рекламной рассылки.</li>
					<li>Форма согласия на обработку персональных данных.</li>
				</ul>
			</div>
		</Container>
	);
}
